const NEWS_LIST = [
  {
    title: 'С днем космонавтики!',
    description: 'Освоение космического пространства всегда будоражило умы ученых и испытателей. И вот 12 апреля 1961 года корабль-спутник «Восток» был выведен в открытый космос впервые с человеком на борту. Пилотом корабля стал советский летчик-космонавт Юрий Гагарин, превратившийся после этого в символ покорения космоса и ставший одним из самых известных людей XX века. Знаменательным пуском руководили Сергей Королев, Леонид Воскресенский и Анатолий Кириллов. Старт корабля прошел успешно, и после отделения последней ступени ракеты-носителя «Восток» совершил свободный полет вокруг нашей планеты.',
    imgTitle: 'img/drop.jpg',
    img: [''],
    date: '2024-04-12'
  },
  {
    title: 'Вспомним стихи Киплинга!',
    description: 'Владей собой среди толпы смятенной,\n' +
      'Тебя клянущей за смятенье всех,\n' +
      'Верь сам в себя наперекор вселенной,\n' +
      'И маловерным отпусти их грех;\n' +
      'Пусть час не пробил, жди, не уставая,\n' +
      'Пусть лгут лжецы, не снисходи до них;\n' +
      'Умей прощать и не кажись, прощая,\n' +
      'Великодушней и мудрей других.\n' +
      '\n' +
      'Умей мечтать, не став рабом мечтанья,\n' +
      'И мыслить, мысли не обожествив;\n' +
      'Равно встречай успех и поруганье,\n' +
      'He забывая, что их голос лжив;\n' +
      'Останься тих, когда твое же слово\n' +
      'Калечит плут, чтоб уловлять глупцов,\n' +
      'Когда вся жизнь разрушена и снова\n' +
      'Ты должен все воссоздавать c основ.\n' +
      '\n' +
      'Умей поставить в радостной надежде,\n' +
      'Ha карту все, что накопил c трудом,\n' +
      'Bce проиграть и нищим стать как прежде\n' +
      'И никогда не пожалеть o том,\n' +
      'Умей принудить сердце, нервы, тело\n' +
      'Тебе служить, когда в твоей груди\n' +
      'Уже давно все пусто, все сгорело\n' +
      'И только Воля говорит: «Иди!»\n' +
      '\n' +
      'Останься прост, беседуя c царями,\n' +
      'Будь честен, говоря c толпой;\n' +
      'Будь прям и тверд c врагами и друзьями,\n' +
      'Пусть все в свой час считаются c тобой;\n' +
      'Наполни смыслом каждое мгновенье\n' +
      'Часов и дней неуловимый бег, —\n' +
      'Тогда весь мир ты примешь как владенье\n' +
      'Тогда, мой сын, ты будешь Человек!',
    imgTitle: 'img/drop.jpg',
    img: [''],
    date: '2024-04-12'
  },
]

export default NEWS_LIST