import { useEffect } from 'react'
import Breadcrumb from './Breadcrumb'
import styles from '../styles/PrivacyPolicy.module.scss'

function PrivacyPolicy() {
  useEffect(() => {
    window.scrollTo(0, 0)
  }, [])

  return (
    <main className={styles.main}>
      <div className={styles.wrapper}>
        <Breadcrumb />

        <h1 className={styles.h1}>Политика конфиденциальности</h1>

        <h2 className={styles.title}>1. Общие положение</h2>
        <p className={styles.text}>Настоящая Политика проводится ЧУДО «УМКА» (далее – «Организация») в отношении обработки и обеспечения защиты
          персональных данных (далее по тексту – настоящая Политика) физических лиц (субъектов персональных данных) на
          основании статьи 24 Конституции РФ, главы 14 Трудового кодекса РФ, Федерального закона от 27.07.2006 N 152-ФЗ
          (ред. от 25.07.2011) “О персональных данных”, других нормативных актов РФ. Политика применяется в отношении всех
          персональных данных (субъектов), которые могут быть получены Организацией в процессе деятельности, в том числе
          работников и клиентов Организации. Цель Политики заключается в доведении до лиц, предоставляющих свои
          персональные данные необходимой информации, позволяющей оценить, какие персональные данные и с какими целями
          обрабатываются Организацией, какие методы обеспечения их безопасности реализуются.
          Политика обеспечивает защиту прав и свобод субъектов при обработке их персональных данных с использованием
          средств автоматизации или без использования таких средств, а также устанавливает ответственность лиц, имеющих
          доступ к персональным данным, за невыполнение требований, регулирующих обработку и защиту персональных данных.
          Клиенты, используя сервисы, услуги Организации, сообщив Организации свои персональные данные, в том числе при
          посредничестве третьих лиц, признают своё согласие на обработку персональных данных в соответствии с настоящей
          Политикой.
          Согласие на обработку персональных данных может быть отозвано субъектом персональных данных. В случае отзыва
          субъектом персональных данных согласия на обработку персональных данных оператор вправе продолжить обработку
          персональных данных без согласия субъекта персональных данных при наличии оснований, указанных действующим
          законодательством. Настоящая Политика может быть изменена при изменении действующего законодательства РФ.
          Организация представляет действующую редакцию Политики на сайтах Организации: http://krasumka.ru/ и
          krasumkaschool.ru</p>

        <h2 className={styles.title}>2. Понятие и состав персональных данных</h2>
        <p className={styles.text}>В целях настоящей Политики под персональными данными понимается любая информация, относящаяся к прямо или
          косвенно определенному или определяемому физическому лицу (субъекту персональных данных). В зависимости от
          субъекта персональных данных, Организация для осуществления своей деятельности и для выполнения своих
          обязательств может обрабатывать персональные данные следующих категорий субъектов:  персональные данные
          работника Организации – информация, необходимая Организации в связи с трудовыми отношениями и касающиеся
          конкретного работника.  персональные данные руководителей, участника (акционера) или сотрудника юридического
          лица, являющегося партнером, контрагентом Организации – информация, необходимая Организации для выполнения своих
          обязательств в рамках договорных отношений с контрагентами/партнерами для выполнения требований законодательства
          Российской Федерации.  персональные данные Клиента – информация, необходимая Организации для выполнения своих
          обязательств в рамках договорных отношений с Клиентом и для выполнения требований законодательства Российской
          Федерации.  Персональные данные Клиента, предоставленные при регистрации на Интернет сайтах http://krasumka.ru/
          и krasumkaschool.ru, в том числе при осуществлении Клиентом Заказов. При оформлении Заказа на Сайте Клиент
          предоставляет следующие персональные данные: Фамилия, Имя, адрес электронной почты, телефон. Продавец использует
          информацию для выполнения своих обязательств перед Клиентом.</p>

        <h2 className={styles.title}>3. Основания и цели обработки персональных данных</h2>
        <p className={styles.text}>Организация обрабатывает персональные данные для осуществления деятельности, реализации своих законных интересов и требований. Цели обработки персональных данных диктуются необходимостью:  осуществлять возложенные на Организацию законодательством Российской Федерации функции в соответствии с ФЗ «О Персональных данных», Трудовым Кодексом РФ, ФЗ «О противодействии легализации (отмыванию) доходов, полученных преступным путем, и финансированию терроризма», ФЗ «О рынке ценных бумаг», «Об индивидуальном (персонифицированном) учете в системе обязательного пенсионного страхования», иными законами и нормативными правовыми актами РФ, а также Уставом и нормативными актами Организации;  Организация собирает и хранит персональные данные Клиента, необходимые для оказания услуг, исполнения соглашений и договоров, исполнения обязательств перед Клиентом. Организация может использовать персональные данные Клиента в следующих целях: - идентификация стороны в рамках договоров с Компанией; - связь с Клиентом в случае необходимости, в том числе направление предложений, уведомлений, информации и запросов, как связанных, так и не связанных с оказанием услуг, а также обработка заявлений, запросов и заявок Клиента; - улучшение качества услуг, оказываемых Компанией;  Организация собирает и хранит персональные данные работника, необходимые для исполнения условий трудового договора и осуществления прав и обязанностей в соответствии с трудовым законодательством, в том числе для обеспечения соблюдения Налогового кодекса Российской Федерации, «Об индивидуальном (персонифицированном) учете в системе обязательного пенсионного страхования».  Организация собирает и хранит персональные данные лица, персональные данные руководителя или сотрудника юридического лица для выполнения требований действующего законодательства РФ.</p>

        <h2 className={styles.title}>4. Сроки обработки персональных данных</h2>
        <p className={styles.text}>Сроки обработки персональных данных определяются исходя из целей обработки в информационных системах Организации, в соответствии со сроком действия договора, соглашения с субъектом персональных данных, с Перечнем управленческих документов, образующихся в процессе деятельности государственных органов, органов местного самоуправления и организаций, сроком исковой давности, а также иными требованиями законодательства и нормативными документами Организации.</p>

        <h2 className={styles.title}>5. Круг лиц допущенных к обработке персональных данных</h2>
        <p className={styles.text}>Для достижения целей статьи 3 настоящей Политики к обработке персональных данных допущены только те сотрудники Организации, на которых возложена такая обязанность в соответствии с их служебными (трудовыми) обязанностями. Доступ других сотрудников может быть предоставлен только в предусмотренных законом случаях. Организация требует от своих сотрудников соблюдения конфиденциальности и обеспечения безопасности персональных данных, при их обработке. Организация вправе передать персональные данные третьим лицам в следующих случаях: - Субъект персональных данных явно выразил свое согласие на такие действия; - Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры; - Передача происходит в рамках продажи или иной передачи бизнеса (полностью или части). При этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученным им данным.</p>

        <h2 className={styles.title}>6. Методы обработки персональных данных</h2>
        <p className={styles.text}>В процессе предоставления услуг, при осуществлении внутрихозяйственной деятельности Организация использует автоматизированную, с применением средств вычислительной техники, так и неавтоматизированную, с применением бумажного документооборота, обработку персональных данных. Принятие решений, порождающих юридические последствия в отношении субъекта персональных данных или иным образом затрагивающих его права и законные интересы, на основании исключительно автоматизированной обработки персональных данных Организацией не производится. В отношении персональной информации пользователя сохраняется конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц. В данном случае пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной. Организация гарантирует организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</p>

        <h2 className={styles.title}>7. Реализация защиты персональных данных</h2>
        <p className={styles.text}>Деятельность Организации по обработке персональных данных в информационных системах неразрывно связана с защитой Организацией конфиденциальности полученной информации. Все работники Организации обязаны обеспечивать конфиденциальность персональных данных, а также об иных сведениях, установленных Организацией, если это не противоречит действующему законодательству РФ. Безопасность персональных данных при их обработке в информационных системах Организации обеспечивается с помощью системы защиты информации, включающей в себя: организационные меры с применением ограничения физического доступа в помещения, применение программно-технических мер защиты. Обмен персональными данными при их обработке в информационных системах осуществляется по каналам связи, защищенным техническими средства защиты информации. При обработке персональных данных в информационных системах Организации обеспечиваются: - проведение мероприятий, направленных на предотвращение несанкционированного доступа к персональным данным и (или) передача их лицам, не имеющим права доступа к такой информации; - своевременное обнаружение фактов несанкционированного доступа к персональным данным; - недопущение воздействия на технические средства автоматизированной обработки персональных данных, в результате которого может быть нарушено их функционирование; - возможность незамедлительного восстановления персональных данных, модифицированных и уничтоженных вследствие несанкционированного доступа к ним; - постоянный контроль уровня защищенности персональных данных. В целях обеспечения соответствия уровня защиты персональных данных требованиям Федерального закона от 27.07.2006 N 152-ФЗ ”О персональных данных” и Федерального закона от 27.07.2006 N 149-ФЗ “Об информации, информационных технологиях и о защите информации” Организация не раскрывает информацию о конкретных применяемых средствах и методах обеспечения информационной безопасности персональных данных. Организация обязуется не разглашать полученную от Клиента информацию. Не считается нарушением предоставление информации агентам и третьим лицам, действующим на основании договора с Организацией, для исполнения обязательств перед Клиентом. Не считается нарушением обязательств разглашение информации в соответствии с обоснованными и применимыми требованиями закона. Продавец не несет ответственности за сведения, предоставленные Клиентом на Сайте в общедоступной форме.</p>

        <h2 className={styles.title}>8. Рассылки на электронную почту</h2>
        <p className={`${styles.text} ${styles.end}`}>Являясь пользователем услуг ЧУДО «УМКА», вы можете получать периодические рассылки (информационные, праздничные и другие) на зарегистрированный адрес электронной почты, а также автоматическое подтверждение ваших заказов и сервисные уведомления. Рассылки на электронную почту проводятся ежемесячно. ЧУДО «УМКА» уважает личную свободу пользователя на получение только тех электронных писем, которые он хочет. Каждый пользователь добровольно выбирает, получать ему рассылку от нас или нет. Для того чтобы отписаться от рассылки вам необходимо снять галочку «Получать рассылку ЧУДО «УМКА». ЧУДО «УМКА» гарантирует, что ваш адрес вашей электронной почты не будет использоваться для рассылки спама.</p>
      </div>
    </main>
  )
}

export default PrivacyPolicy